# GetUpstreamSegments Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData..::..GetUpstreamSegments Method
MEPNetworkSegmentData Class See Also
---
Gets all upstream network segments.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IList<MEPNetworkSegmentId> GetUpstreamSegments()
```

Visual Basic
---
```text
Public Function GetUpstreamSegments As IList(Of MEPNetworkSegmentId)
```

Visual C++
---
```text
public:
IList<MEPNetworkSegmentId^>^ GetUpstreamSegments()
```

# ### Return Value
The list of segments that flow into this segment.
# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace